In [3]:
import sqlite3
import pandas as pd

In [4]:
# Connect to the database file or create it if it doesn't exist
conn = sqlite3.connect('C:/Users/user/OneDrive - JLYON/Desktop/airline2.db')

# Create a cursor object to execute SQL commands
c = conn.cursor()

Which of the following companies has the highest number of cancelled flights?

In [5]:
query = """SELECT carriers.Description, count(*)
FROM carriers JOIN ontime ON ontime.UniqueCarrier = carriers.Code
WHERE ontime.Cancelled =1 
GROUP BY carriers.Description
ORDER BY count() DESC"""
result = c.execute(query)

In [40]:
pd.read_sql_query(query,conn).head()

                                         Description  count(*)
0                               Delta Air Lines Inc.    107851
1                             American Airlines Inc.    105762
2                              United Air Lines Inc.    102066
3                       American Eagle Airlines Inc.     96365
4  US Airways Inc. (Merged with America West 9/05...     85866

In [41]:
print("DELTA has the highest number of cancelled flights")

DELTA has the highest number of cancelled flights

Which of the following airplanes has the lowest associated average departure delay (excluding cancelled and diverted flights)?

In [6]:
query2 = """SELECT plane.model, avg(ontime.DepDelay)
FROM plane JOIN ontime USING(tailnum)
WHERE ontime.cancelled = 0 AND ontime.Diverted=0 AND ontime.DepDelay>0
GROUP BY model
ORDER BY avg(ontime.DepDelay)"""
result = c.execute(query2)

In [7]:
pd.read_sql_query(query2,conn).head()

      model  avg(ontime.DepDelay)
0   737-2Y5              7.022026
1   737-282              8.433566
2   737-230             10.458647
3  737-282C             11.765766
4   767-324             15.788051

In [15]:
print("737-2Y5 has the lowest associated average departure delay")

737-2Y5 has the lowest associated average departure delay

Which of the following companies has the highest number of cancelled flights, relative to their number of total flights?

In [8]:
query3 = """SELECT q1.carrier AS carrier, (CAST(q1.numerator AS FLOAT)/ CAST(q2.denominator AS FLOAT)) AS ratio

FROM
(SELECT carriers.Description AS carrier, COUNT(*) AS numerator
FROM carriers JOIN ontime ON ontime.UniqueCarrier = carriers.Code
WHERE ontime.Cancelled = 1 AND carriers.Description IN ('United Air Lines Inc.', 'American Airlines Inc.', 'Pinnacle Airlines Inc.', 'Delta Air Lines Inc.')
GROUP BY carriers.Description
) AS q1 JOIN

(SELECT carriers.Description AS carrier, COUNT(*) AS denominator
FROM carriers JOIN ontime ON ontime.UniqueCarrier = carriers.Code
WHERE carriers.Description IN ('United Air Lines Inc.', 'American Airlines Inc.', 'Pinnacle Airlines Inc.', 'Delta Air Lines Inc.')
GROUP BY carriers.Description
) AS q2 USING(carrier)

ORDER BY ratio DESC"""
result = c.execute(query3)

In [9]:
pd.read_sql_query(query3,conn).head()

                  carrier     ratio
0   United Air Lines Inc.  0.027924
1    Delta Air Lines Inc.  0.024082
2  American Airlines Inc.  0.023841

In [14]:
print("United Air Lines Inc as the highest number of cancelled flights, relative to their number of total flights")

United Air Lines Inc as the highest number of cancelled flights, relative to their number of total flights

Which of the following cities has the highest number of inbound flights (excluding cancelled flights)?

In [11]:
query4= """SELECT airports.city AS cities, count(*)
FROM airports JOIN ontime ON ontime.dest = airports.iata
WHERE ontime.Cancelled = 0
GROUP BY airports.city
ORDER BY count() DESC"""
result = c.execute(query4)

In [12]:
pd.read_sql_query(query4,conn).head()

              cities  count(*)
0            Chicago   2388365
1            Atlanta   1912370
2  Dallas-Fort Worth   1781833
3            Houston   1304407
4        Los Angeles   1279514

In [13]:
print("Chicago has the highest number of inbound flights")

Chicago has the highest number of inbound flights